# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
# tap 'caskroom/versions'
tap 'homebrew/bundle'
# tap 'homebrew/dupes'
# tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
# brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
# brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
# brew 'homebrew/dupes/grep'

# Install Binaries
# brew 'awscli'
brew 'git'
# brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
# brew 'node'
# brew 'trash'
# brew 'wget'

# Development
# brew 'php71', args: ['with-debug']
# brew 'mariadb'

# Apps
cask 'adobe-creative-cloud'
# cask 'aerial'
# cask 'alfred'
# cask 'better-touch-tool'
# cask 'caffeine'
cask 'carbon-copy-cloner'
cask 'cloak'
cask 'coda'
# cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
# cask 'google-drive'
# cask 'iterm2'
cask 'kaleidoscope'
cask 'microsoft-office'
# cask 'mysqlworkbench'
# cask 'phpstorm'
# cask 'quip'
# cask 'sequel-pro'
# cask 'slack'
cask 'spillo'
# cask 'sublime-text'
cask 'textmate'
cask 'the-unarchiver'
cask 'tower'
cask 'transmit'
# cask 'vagrant'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
cask 'viscosity'
cask 'vlc'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
cask 'qlstephen'
cask 'quicklookase'

# Fonts
# cask 'font-sauce-code-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Blocker', id: 1107421413
mas '1Password', id: 443987910
mas 'BetterSnapTool', id: 417375580 
# mas 'Byword', id: 420212497
mas 'Contacts Cleaner', id: 411369012
mas 'Copied', id: 1026349850
mas 'DaisyDisk', id: 411643860
# mas 'Deckset', id: 847496013
mas 'Deliveries', id: 924726344
mas 'GarageBand', id: 682658836
# mas 'Giphy Capture', id: 668208984
mas 'Home Inventory', id: 413564952
mas 'iMovie', id: 408981434
mas 'iStat Mini', id: 927292435
mas 'Keynote', id: 409183694
mas 'Lynda.com', id: 985958984
mas 'Microsoft Remote Desktop', id: 715768417
mas 'MindNode', id: 992076693
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Paprika Recipe Manager', id: 451907568
# mas 'Paw', id: 584653203
mas 'Reeder', id: 880001334
mas 'Screens', id: 446107677
mas 'Sip', id: 507257563
# mas 'Sketch', id: 402476602
mas 'Things', id: 407951449
mas 'Tweetbot', id: 557168941
mas 'Wifi Explorer', id: 494803304
# mas 'Xcode', id: 497799835
